Revit 2024 API
InsulationTypeSet.Erase Method
Removes a specified insulation type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	InsulationType item
)
Visual Basic
Public Overridable Function Erase ( _
	item As InsulationType _
) As Integer
Visual C++
public:
virtual int Erase(
	InsulationType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.InsulationType
The insulation type to be erased.
Return Value
The number of insulation types that were erased from the set.
See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace